[{"no": 1, "principle": "1. Segmentation", "approache": ["a. Divide an object into independent parts.", "b. Make an object sectional (for easy assembly or disassembly).", "c. Increase the degree of an object’s segmentation.", "d. Use a work breakdown structure for a large project"]}, {"no": 2, "principle": "2. Extraction (Extracting, Retrieving, Removing)", "approache": ["a. Extract the “disturbing” part or property from an object.", "b. Extract only the necessary part or property from an object."]}, {"no": 3, "principle": "3. Local Quality", "approache": ["a. Transition from homogeneous to heterogeneous structure of an object or outside environment (action).", "b. Different parts of an object should carry out different functions.", "c. Each part of an object should be placed under conditions that are most favorable for its operation."]}, {"no": 4, "principle": "4. Asymmetry", "approache": ["a. Replace symmetrical form(s) with asymmetrical form(s).", "b. If an object is already asymmetrical, increase its degree of asymmetry."]}, {"no": 5, "principle": "5. Consolidation", "approache": ["a. Consolidate in space homogeneous objects, or objects destined for contiguous operations.", "b. Consolidate in time homogeneous or contiguous operations."]}, {"no": 6, "principle": "6. Universality", "approache": ["a. An object can perform several different functions; therefore, other elements can be removed."]}, {"no": 7, "principle": "7. Nesting (Matrioshka)", "approache": ["a. One object is placed inside another. That object is placed inside a third one. And so on . . .", "b. An object passes through a cavity in another object."]}, {"no": 8, "principle": "8. Counterweight", "approache": ["a. Compensate for the weight of an object by combining it with another object that provides a lifting force. ", "b. Compensate for the weight of an object with aerodynamic or hydrodynamic forces influenced by the outside environment."]}, {"no": 9, "principle": "9. Prior Counteraction", "approache": ["a. Preload countertension to an object to compensate excessive and undesirable stress."]}, {"no": 10, "principle": "10. Prior Action", "approache": ["a. Perform required changes to an object completely or partially in advance.", "b. Place objects in advance so that they can go into action immediately from the most convenient location."]}, {"no": 11, "principle": "11. Cushion in Advance", "approache": ["a. Compensate for the relatively low reliability of an object with emergency measures prepared in advance."]}, {"no": 12, "principle": "12. Equipotentiality", "approache": ["a. Change the condition of the work in such a way that it will not require lifting or lowering an object."]}, {"no": 13, "principle": "13. Do It in Reverse", "approache": ["a. Instead of the direct action dictated by a problem, implement an opposite action (i.e., cooling instead of heating).", "b. Make the movable part of an object, or outside environment, stationary — and stationary part moveable.", "c. Turn an object upside-down."]}, {"no": 14, "principle": "14. Spheroidality", "approache": ["a. Replace linear parts with curved parts, flat surfaces with spherical surfaces, and cube shapes with ball shapes.", "b. Use rollers, balls, spirals.", "c. Replace linear motion with rotational motion; utilize centrifugal force."]}, {"no": 15, "principle": "15. Dynamicity", "approache": ["a. Characteristics of an object or outside environment, must be altered to provide optimal performance at each stage of an operation.", "b. If an object is immobile, make it mobile. Make it interchangeable.", "c. Divide an object into elements capable of changing their position relative to each other."]}, {"no": 16, "principle": "16. Partial or Excessive Action", "approache": ["a. If it is difficult to obtain 100% of a desired effect, achieve more or less of the desired effect."]}, {"no": 17, "principle": "17. Transition Into a New Dimension", "approache": ["a. Transition one-dimensional movement, or placement, of objects into two-dimensional; two-dimensional to three-dimensional, etc.", "b. Utilize multi-level composition of objects.", "c. Incline an object, or place it on its side.", "d. Utilize the opposite side of a given surface.", "e. Project optical lines onto neighboring areas, or onto the reverse side, of an object."]}, {"no": 18, "principle": "18. Mechanical Vibration", "approache": ["a. Utilize oscillation.", "b. If oscillation exists, increase its frequency to ultrasonic.", "c. Use the frequency of resonance.", "d. Replace mechanical vibrations with piezovibrations.", "e. Use ultrasonic vibrations in conjunction with an electromagnetic field."]}, {"no": 19, "principle": "19. Periodic Action", "approache": ["a. Replace a continuous action with a periodic one (impulse).", "b. If the action is already periodic, change its frequency.", "c. Use pauses between impulses to provide additional action."]}, {"no": 20, "principle": "20. Continuity of Useful Action", "approache": ["a. Carry out an action without a break. All parts of the object should constantly operate at full capacity.", "b. Remove idle and intermediate motion.", "c. Replace “back-and-forth” motion with a rotating one."]}, {"no": 21, "principle": "21. Rushing Through", "approache": ["a. Perform harmful and hazardous operations at a very high speed."]}, {"no": 22, "principle": "22. Convert Harm Into Benefit", "approache": ["a. Utilize harmful factors — especially environmental — to obtain a positive effect.", "b. Remove one harmful factor by combining it with another harmful factor.", "c. Increase the degree of harmful action to such an extent that it ceases to be harmful."]}, {"no": 23, "principle": "23. Feedback", "approache": ["a. Introduce feedback.", "b. If feedback already exists, change it."]}, {"no": 24, "principle": "24. Mediator", "approache": ["a. Use an intermediary object to transfer or carry out an action.", "b. Temporarily connect the original object to one that is easily removed. "]}, {"no": 25, "principle": "25. Self-service", "approache": ["a. An object must service itself and carry out supplementary and repair operations.", "b. Make use of waste material and energy."]}, {"no": 26, "principle": "26. Copying", "approache": ["a. A simplified and inexpensive copy should be used in place of a fragile original or an object that is inconvenient to operate.", "b. If a visible optical copy is used, replace it with an infrared or ultraviolet copies.", "c. Replace an object (or system of objects) with their optical image. The image can then be reduced or enlarged."]}, {"no": 27, "principle": "27. Dispose", "approache": ["a. Replace an expensive object with a cheap one, compromising other properties (i.e., longevity)."]}, {"no": 28, "principle": "28. Replacement of Mechanical System", "approache": ["a. Replace a mechanical system with an optical, acoustical, thermal or olfactory system.", "b. Use an electric, magnetic or electromagnetic field to interact with an object.", "c. Replace fields that are: 1. Stationary with mobile, 2. Fixed with changing in time, 3. Random with structured.", "d. Use fields in conjunction with ferromagnetic "]}, {"no": 29, "principle": "29. Pneumatic or Hydraulic Constructions", "approache": ["a. Replace solid parts of an object with a gas or liquid. These parts can now use air or water for inflation, or use pneumatic or hydrostatic cushions."]}, {"no": 30, "principle": "30. Flexible Membranes or Thin Films", "approache": ["a. Replace customary constructions with flexible membranes or thin film.", "b. Isolate an object from its outside environment with flexible membranes or thin films."]}, {"no": 31, "principle": "31. Porous Material", "approache": ["a. Make an object porous, or use supplementary porous elements (inserts, covers, etc.).", "b. If an object is already porous, fill pores in advance with some substance."]}, {"no": 32, "principle": "32. Changing the Color", "approache": ["a. Change the color of an object or its environment.", "b. Change the degree of translucency of an object or its environment.", "c. Use color additives to observe an object, or process which is difficult to see.", "d. If such additives are already used, employ luminescent traces or trace atoms."]}, {"no": 33, "principle": "33. Homogeneity", "approache": ["a. Objects interacting with the main object should be made out of the same material (or material with similar properties) as the main object."]}, {"no": 34, "principle": "34. Rejecting and Regenerating Parts", "approache": ["a. After completing its function, or becoming useless, an element of an object is rejected (discarded, dissolved, evaporated, etc.) or modified during its work process."]}, {"no": 35, "principle": "", "approache": ["b. Used-up parts of an object should be restored during its work.", "a. Change the physical state of the system.", "b. Change the concentration or density.", "c. Change the degree of flexibility.", "d. Change the temperature or volume."]}, {"no": 36, "principle": "36. Phase Transition", "approache": ["a. Using the phenomena of phase change (i.e., a change in volume, the liberation or absorption of heat, etc.)."]}, {"no": 37, "principle": "37. Thermal Expansion", "approache": ["a. Use expansion or contraction of material by changing its temperature.", "b. Use various materials with different coefficients of thermal expansion."]}, {"no": 38, "principle": "38. Accelerated Oxidation", "approache": ["a. Make transition from one level of oxidation to the next higher level: 1. Ambient air to oxygenated, 2. Oxygenated to oxygen, 3. Oxygen to ionized oxygen, 4. Ionized oxygen to ozoned oxygen, 5. Ozoned oxygen to ozone, 6. Ozone to singlet oxygen."]}, {"no": 39, "principle": "39. Inert Environment", "approache": ["a. Replace a normal environment with an inert one.", "b. Introduce a neutral substance or additives into an object.", "c. Carry out the process in a vacuum."]}, {"no": 40, "principle": "40. Composite Materials", "approache": ["a. Replace homogeneous materials with composite ones"]}]